var e = new Array(19416, 19168, 42352, 21717, 53856, 55632, 91476, 22176, 39632, 21970, 19168, 42422, 42192, 53840, 119381, 46400, 54944, 44450, 38320, 84343, 18800, 42160, 46261, 27216, 27968, 109396, 11104, 38256, 21234, 18800, 25958, 54432, 59984, 28309, 23248, 11104, 100067, 37600, 116951, 51536, 54432, 120998, 46416, 22176, 107956, 9680, 37584, 53938, 43344, 46423, 27808, 46416, 86869, 19872, 42448, 83315, 21200, 43432, 59728, 27296, 44710, 43856, 19296, 43748, 42352, 21088, 62051, 55632, 23383, 22176, 38608, 19925, 19152, 42192, 54484, 53840, 54616, 46400, 46496, 103846, 38320, 18864, 43380, 42160, 45690, 27216, 27968, 44870, 43872, 38256, 19189, 18800, 25776, 29859, 59984, 27480, 21952, 43872, 38613, 37600, 51552, 55636, 54432, 55888, 30034, 22176, 43959, 9680, 37584, 51893, 43344, 46240, 47780, 44368, 21977, 19360, 42416, 86390, 21168, 43312, 31060, 27296, 44368, 23378, 19296, 42726, 42208, 53856, 60005, 54576, 23200, 30371, 38608, 19415, 19152, 42192, 118966, 53840, 54560, 56645, 46496, 22224, 21938, 18864, 42359, 42160, 43600, 111189, 27936, 44448), a = new Array("甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"), r = new Array("子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"), t = new Array("鼠", "牛", "虎", "兔", "龙", "蛇", "马", "羊", "猴", "鸡", "狗", "猪"), s = (new Array(0, 21208, 42467, 63836, 85337, 107014, 128867, 150921, 173149, 195551, 218072, 240693, 263343, 285989, 308563, 331033, 353350, 375494, 397447, 419210, 440795, 462224, 483532, 504758), 
new Array("日", "一", "二", "三", "四", "五", "六", "七", "八", "九", "十")), n = new Array("初", "十", "廿", "卅", "□"), i = new Array("正", "二", "三", "四", "五", "六", "七", "八", "九", "十", "十一", "腊"), h = new Array("0101*元旦", "0214 情人节", "0308 妇女节", "0312 植树节", "0401 愚人节", "0422 地球日", "0501 劳动节", "0504 青年节", "0531 无烟日", "0601 儿童节", "0606 爱眼日", "0701 建党日", "0707 抗战纪念日", "0801 建军节", "0910 教师节", "0918 九·一八事变纪念日", "1001*国庆节", "1031 万圣节", "1111 光棍节", "1201 艾滋病日", "1213 南京大屠杀纪念日", "1224 平安夜", "1225 圣诞节"), c = new Array("0520 母亲节", "0630 父亲节", "1144 感恩节"), o = new Array("0101*春节", "0115 元宵节", "0202 龙抬头", "0505 端午节", "0707 七夕", "0715 中元节", "0815 中秋节", "0909 重阳节", "1208 腊八节", "1223 小年", "0100*除夕");

function u(a) {
    var r, t = 348;
    for (r = 32768; r > 8; r >>= 1) t += e[a - 1900] & r ? 1 : 0;
    return t + l(a);
}

function l(a) {
    return y(a) ? 65536 & e[a - 1900] ? 30 : 29 : 0;
}

function y(a) {
    return 15 & e[a - 1900];
}

function f(a, r) {
    return e[a - 1900] & 65536 >> r ? 30 : 29;
}

function g(e) {
    var a, r, t = new Date(e.getFullYear(), e.getMonth(), e.getDate()), s = 0, n = new Date(1900, 0, 31), i = Math.round((t - n) / 864e5);
    for (this.dayCyl = i + 40, this.monCyl = 14, a = 1900; a < 2050 && i > 0; a++) i -= s = u(a), 
    this.monCyl += 12;
    for (i < 0 && (i += s, a--, this.monCyl -= 12), this.year = a, this.yearCyl = a - 1864, 
    r = y(a), this.isLeap = !1, a = 1; a < 13 && i > 0; a++) r > 0 && a == r + 1 && 0 == this.isLeap ? (--a, 
    this.isLeap = !0, s = l(this.year)) : s = f(this.year, a), 1 == this.isLeap && a == r + 1 && (this.isLeap = !1), 
    i -= s, 0 == this.isLeap && this.monCyl++;
    0 == i && r > 0 && a == r + 1 && (this.isLeap ? this.isLeap = !1 : (this.isLeap = !0, 
    --a, --this.monCyl)), i < 0 && (i += s, --a, --this.monCyl), this.month = a, this.day = i + 1;
}

function p(e, a) {
    for (var r, t = e.getFullYear(), s = e.getMonth() + 1, n = e.getDate(), i = 0, h = (r = t) % 4 == 0 && (r % 100 != 0 || r % 400 == 0), c = 1900; c < t; c++) i += u(c);
    for (c = 1; c < s; c++) c == y(t) && (i += l(t)), i += f(t, c);
    h && a && (i += f(t, c)), i += parseInt(n) - 1;
    var o = new Date(1900, 0, 31), g = new Date(o.valueOf() + 864e5 * i);
    this.year = g.getFullYear(), this.month = g.getMonth(), this.day = g.getDate(), 
    this.isLeap = h;
}

function w(e) {
    return a[e % 10] + r[e % 12];
}

var m = new Array("小寒", "大寒", "立春", "雨水", "惊蛰", "春分", "清明", "谷雨", "立夏", "小满", "芒种", "夏至", "小暑", "大暑", "立秋", "处暑", "白露", "秋分", "寒露", "霜降", "立冬", "小雪", "大雪", "冬至"), v = new Array(4, 19, 3, 18, 4, 19, 4, 19, 4, 20, 4, 20, 6, 22, 6, 22, 6, 22, 7, 22, 6, 21, 6, 21);

function D(e, a) {
    return v[a] + Math.floor("211122112122112121222211221122122222212222222221222122222232222222222222222233223232223232222222322222112122112121222211222122222222222222222222322222112122112121222111211122122222212221222221221122122222222222222222222223222232222232222222222222112122112121122111211122122122212221222221221122122222222222222221211122112122212221222211222122222232222232222222222222112122112121111111222222112121112121111111222222111121112121111111211122112122112121122111222212111121111121111111111122112122112121122111211122112122212221222221222211111121111121111111222111111121111111111111111122112121112121111111222111111111111111111111111122111121112121111111221122122222212221222221222111011111111111111111111122111121111121111111211122112122112121122211221111011111101111111111111112111121111121111111211122112122112221222211221111011111101111111110111111111121111111111111111122112121112121122111111011111121111111111111111011111111112111111111111011111111111111111111221111011111101110111110111011011111111111111111221111011011101110111110111011011111101111111111211111001011101110111110110011011111101111111111211111001011001010111110110011011111101111111110211111001011001010111100110011011011101110111110211111001011001010011100110011001011101110111110211111001010001010011000100011001011001010111110111111001010001010011000111111111111111111111111100011001011001010111100111111001010001010000000111111000010000010000000100011001011001010011100110011001011001110111110100011001010001010011000110011001011001010111110111100000010000000000000000011001010001010011000111100000000000000000000000011001010001010000000111000000000000000000000000011001010000010000000".charAt(24 * (Math.floor("0123415341536789:;<9:=<>:=1>?012@015@015@015AB78CDE8CD=1FD01GH01GH01IH01IJ0KLMN;LMBEOPDQRST0RUH0RVH0RWH0RWM0XYMNZ[MB\\]PT^_ST`_WH`_WH`_WM`_WM`aYMbc[Mde]Sfe]gfh_gih_Wih_WjhaWjka[jkl[jmn]ope]qph_qrh_sth_W".charCodeAt(e - 1900)) - 48) + a));
}

function M(e, a, r, h, c, o, u, l, y, f, g) {
    this.sYear = e, this.sMonth = a, this.sDay = r, this.week = h, this.lYear = c, this.lMonth = o, 
    this.lDay = u, this.isLeap = l, this.cYear = y, this.cMonth = f, this.cDay = g, 
    this.lunarDay = function(e) {
        var a;
        switch (e) {
          case 10:
            a = "初十";
            break;

          case 20:
            a = "二十";
            break;

          case 30:
            a = "三十";
            break;

          default:
            a = n[Math.floor(e / 10)], a += s[e % 10];
        }
        return a;
    }(u), this.lunarMonth = i[o - 1], this.lunarYear = t[(c - 1900) % 12], this.lunarFestival = "", 
    this.solarFestival = "", this.solarTerms = "";
}

function d(e, a, r, t, s, n, i, u) {
    var l, y, g = {};
    l = w(a < 2 ? e - 1900 + 36 - 1 : e - 1900 + 36);
    var p = D(e, 2), v = D(e, 2 * a);
    y = w(12 * (e - 1900) + a + 12), 1 == a && r >= p && (l = w(e - 1900 + 36)), r >= v && (y = w(12 * (e - 1900) + a + 13)), 
    g = new M(e, a + 1, r, t, s, n, i, u, l, y, w(Date.UTC(e, a, 1, 0, 0, 0, 0) / 864e5 + 25567 + 10 + r - 1));
    var d = D(e, 2 * a) - 1, A = D(e, 2 * a + 1) - 1;
    d == r - 1 && (g.solarTerms = m[2 * a]), A == r - 1 && (g.solarTerms = m[2 * a + 1]);
    for (var b, C = 0; b = h[C]; C++) b.match(/^(\d{2})(\d{2})([\s\*])(.+)$/) && Number(RegExp.$1) == a + 1 && Number(RegExp.$2) == r && (g.solarFestival += RegExp.$4 + " ");
    for (C = 0; b = c[C]; C++) {
        if (b.match(/^(\d{2})(\d)(\d)([\s\*])(.+)$/)) if (Number(RegExp.$1) == a + 1) if (d = Number(RegExp.$2), 
        A = Number(RegExp.$3), d < 5) if ((0 == A ? 7 : 0) + 7 * (d - 1) + A == r) {
            g.solarFestival += RegExp.$5 + " ";
            break;
        }
    }
    for (C = 0; b = o[C]; C++) if (b.match(/^(\d{2})(.{2})([\s\*])(.+)$/)) {
        d = Number(RegExp.$1), A = Number(RegExp.$2);
        var L = f(s, n);
        if (d == n && A == i || "00" == A && 12 == n && L == i) {
            g.lunarFestival += RegExp.$4 + " ";
            break;
        }
    }
    return g;
}

module.exports = {
    CalendarConverter: function() {
        this.solar2lunar = function(e) {
            var a = e.getFullYear(), r = e.getMonth(), t = e.getDate(), n = s[e.getDay()], i = new g(e);
            return d(a, r, t, n, i.year, i.month, i.day, i.isLeap);
        }, this.GetTideType = function(e) {
            switch (e) {
              case "初三":
              case "十七":
                return "巨潮(活汛)";

              case "初一":
              case "初二":
              case "十五":
              case "十六":
                return "大潮(活汛)";

              case "十二":
              case "十三":
              case "廿七":
              case "廿八":
                return "中潮(死汛)";

              case "初四":
              case "初五":
              case "初六":
              case "初七":
              case "十四":
              case "十八":
              case "十九":
              case "二十":
              case "廿一":
              case "廿九":
              case "三十":
                return "中潮(活汛)";

              case "初八":
              case "廿二":
                return "小潮(活汛)";

              case "初十":
              case "十一":
              case "廿三":
              case "廿五":
              case "廿六":
                return "小潮(死汛)";

              case "初九":
              case "廿四":
                return "微潮(死汛)";

              default:
                return "";
            }
        }, this.GetCSS = function(e) {
            var a = "";
            switch (e) {
              case "巨潮(活汛)":
              case "大潮(活汛)":
                a = "da";
                break;

              case "中潮(死汛)":
              case "中潮(活汛)":
                a = "zhong";
                break;

              case "小潮(活汛)":
              case "小潮(死汛)":
              case "微潮(死汛)":
                a = "xiao";
            }
            return a;
        }, this.GetWeekDate = function(e, a) {
            var r = new Array("星期日", "星期一", "星期二", "星期三", "星期四", "星期五", "星期六");
            return 2 == a && (r = new Array("周日", "周一", "周二", "周三", "周四", "周五", "周六")), r[e];
        }, this.lunar2solar = function(e, a) {
            var r = e.getFullYear(), t = e.getMonth() + 1, n = e.getDate(), i = new p(e, a), h = i.year, c = i.month, o = i.day;
            return d(h, c, o, s[new Date(h, c, o).getDay()], r, t, n, i.isLeap);
        };
    }
};